MAL-Organization/MAL/library/src/hspec/stm/stm32f0/mal_hspec_stm32f0_timer.c
mal_error_e mal_hspec_stm32f0_timer_get_input_clk(mal_hspec_timer_e timer,
												  uint64_t *clock) {
	// MCU clocks
	RCC_ClocksTypeDef clocks;
	RCC_GetClocksFreq(&clocks);
	// APB Prescaler
	uint32_t apb_pre = RCC->CFGR & RCC_CFGR_PPRE;

	*clock = clocks.PCLK_Frequency;
	if (apb_pre != RCC_CFGR_PPRE_DIV1) {
		// Times 2, see clock tree in datasheet
		*clock += *clock;
	}
	return MAL_ERROR_OK;
}

void TIM1_BRK_UP_TRG_COM_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM1->DIER & TIM_DIER_CC1IE) {
		cc_flags |= TIM1->SR & TIM_FLAG_CC1;
	}
	if (TIM1->DIER & TIM_DIER_CC2IE) {
		cc_flags |= TIM1->SR & TIM_FLAG_CC2;
	}
	if (TIM1->DIER & TIM_DIER_CC3IE) {
		cc_flags |= TIM1->SR & TIM_FLAG_CC3;
	}
	if (TIM1->DIER & TIM_DIER_CC4IE) {
		cc_flags |= TIM1->SR & TIM_FLAG_CC4;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM1, TIM_FLAG_Update|TIM_FLAG_CC1|TIM_FLAG_CC2|TIM_FLAG_CC3|TIM_FLAG_CC4);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_1, TIM1, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_1);
	}
}

void TIM2_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM2->DIER & TIM_DIER_CC1IE) {
		cc_flags |= TIM2->SR & TIM_FLAG_CC1;
	}
	if (TIM2->DIER & TIM_DIER_CC2IE) {
		cc_flags |= TIM2->SR & TIM_FLAG_CC2;
	}
	if (TIM2->DIER & TIM_DIER_CC3IE) {
		cc_flags |= TIM2->SR & TIM_FLAG_CC3;
	}
	if (TIM2->DIER & TIM_DIER_CC4IE) {
		cc_flags |= TIM2->SR & TIM_FLAG_CC4;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM2, TIM_FLAG_Update|TIM_FLAG_CC1|TIM_FLAG_CC2|TIM_FLAG_CC3|TIM_FLAG_CC4);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_2, TIM2, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_2);
	}
}

void TIM3_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM3->DIER & TIM_DIER_CC1IE) {
		cc_flags |= TIM3->SR & TIM_FLAG_CC1;
	}
	if (TIM3->DIER & TIM_DIER_CC2IE) {
		cc_flags |= TIM3->SR & TIM_FLAG_CC2;
	}
	if (TIM3->DIER & TIM_DIER_CC3IE) {
		cc_flags |= TIM3->SR & TIM_FLAG_CC3;
	}
	if (TIM3->DIER & TIM_DIER_CC4IE) {
		cc_flags |= TIM3->SR & TIM_FLAG_CC4;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM3, TIM_FLAG_Update|TIM_FLAG_CC1|TIM_FLAG_CC2|TIM_FLAG_CC3|TIM_FLAG_CC4);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_3, TIM3, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_3);
	}
}

void TIM6_DAC_IRQHandler(void) {
	TIM_ClearFlag(TIM6, TIM_FLAG_Update);
	// Handles tick
	INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_6);
}

void TIM7_IRQHandler(void) {
	TIM_ClearFlag(TIM7, TIM_FLAG_Update);
	// Handles tick
	INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_7);
}

void TIM14_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM14->DIER & TIM_DIER_CC1IE) {
		cc_flags = TIM14->SR & TIM_FLAG_CC1;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM14, TIM_FLAG_Update|TIM_FLAG_CC1);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_14, TIM14, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_14);
	}
}

void TIM15_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM15->DIER & TIM_DIER_CC1IE) {
		cc_flags |= TIM15->SR & TIM_FLAG_CC1;
	}
	if (TIM15->DIER & TIM_DIER_CC2IE) {
		cc_flags |= TIM15->SR & TIM_FLAG_CC2;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM15, TIM_FLAG_Update|TIM_FLAG_CC1|TIM_FLAG_CC2);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_15, TIM15, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_15);
	}
}

void TIM16_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM16->DIER & TIM_DIER_CC1IE) {
		cc_flags = TIM16->SR & TIM_FLAG_CC1;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM16, TIM_FLAG_Update|TIM_FLAG_CC1);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_16, TIM16, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_16);
	}
}

void TIM17_IRQHandler(void) {
	// Check if this is a capture interrupt
	uint16_t cc_flags = 0;
	if (TIM17->DIER & TIM_DIER_CC1IE) {
		cc_flags = TIM17->SR & TIM_FLAG_CC1;
	}
	// Clear interrupts
	TIM_ClearFlag(TIM17, TIM_FLAG_Update|TIM_FLAG_CC1);
	// Handles interrupt
	if (cc_flags) {
		timer_input_capture_interrupt(MAL_HSPEC_TIMER_17, TIM17, cc_flags);
	} else {
		INVOKE_TASK_CALLBACK(MAL_HSPEC_TIMER_17);
	}
}

mal_error_e mal_hspec_stm32f0_timer_free(mal_hspec_timer_e timer) {
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(timer);
	// Disable timer
	TIM_Cmd(tim, DISABLE);
	// Disable interrupt
	TIM_ITConfig(tim, TIM_IT_Update|TIM_FLAG_CC1|TIM_FLAG_CC2|TIM_FLAG_CC3|TIM_FLAG_CC4, DISABLE);
	NVIC_DisableIRQ(mal_hspec_stm32f0_get_timer_update_irq(timer));
	NVIC_DisableIRQ(mal_hspec_stm32f0_get_timer_compare_irq(timer));
	// Unitialise timer
	TIM_DeInit(tim);
	// Remove callback
	timer_callbacks[timer].task_cb = NULL;
	timer_callbacks[timer].ic_cb = NULL;

	return MAL_ERROR_OK;
}

bool mal_hspec_stm32f0_disable_timer_interrupt(mal_hspec_timer_e timer) {
	IRQn_Type irq = mal_hspec_stm32f0_get_timer_update_irq(timer);
	bool active = NVIC_GetActive(irq);
	NVIC_DisableIRQ(irq);
	__DSB();
	__ISB();
	return active;
}

static uint16_t get_timer_channel(const mal_hspec_gpio_s *gpio, mal_hspec_timer_e timer) {
	const mal_hspec_stm32f0_af_e (*timer_afs)[MAL_HSPEC_GPIO_PORT_SIZE][MAL_HSPEC_STM32F0_GPIO_PORT_SIZE][MAL_HSPEC_TIMER_SIZE];
	// Fetch timer alternate functions
	mal_hspec_stm32f0_get_timer_afs(&timer_afs);
	switch ((*timer_afs)[gpio->port][gpio->pin][timer]) {
		case MAL_HSPEC_STM32F0_AF_TIM1_CH1:
		case MAL_HSPEC_STM32F0_AF_TIM1_CH1N:
		case MAL_HSPEC_STM32F0_AF_TIM3_CH1:
		case MAL_HSPEC_STM32F0_AF_TIM14_CH1:
		case MAL_HSPEC_STM32F0_AF_TIM15_CH1:
		case MAL_HSPEC_STM32F0_AF_TIM15_CH1N:
		case MAL_HSPEC_STM32F0_AF_TIM16_CH1:
		case MAL_HSPEC_STM32F0_AF_TIM16_CH1N:
		case MAL_HSPEC_STM32F0_AF_TIM17_CH1:
		case MAL_HSPEC_STM32F0_AF_TIM17_CH1N:
			return TIM_Channel_1;
		case MAL_HSPEC_STM32F0_AF_TIM1_CH2:
		case MAL_HSPEC_STM32F0_AF_TIM1_CH2N:
		case MAL_HSPEC_STM32F0_AF_TIM2_CH2:
		case MAL_HSPEC_STM32F0_AF_TIM3_CH2:
		case MAL_HSPEC_STM32F0_AF_TIM15_CH2:
			return TIM_Channel_2;
		case MAL_HSPEC_STM32F0_AF_TIM1_CH3:
		case MAL_HSPEC_STM32F0_AF_TIM1_CH3N:
		case MAL_HSPEC_STM32F0_AF_TIM2_CH3:
		case MAL_HSPEC_STM32F0_AF_TIM3_CH3:
			return TIM_Channel_3;
		case MAL_HSPEC_STM32F0_AF_TIM1_CH4:
		case MAL_HSPEC_STM32F0_AF_TIM2_CH4:
		case MAL_HSPEC_STM32F0_AF_TIM3_CH4:
			return TIM_Channel_4;
		default:
			return UINT16_MAX;
	}
}

mal_error_e mal_hspec_stm32f0_timer_get_resolution(mal_hspec_timer_e timer, uint8_t *resolution) {
	switch (timer) {
		case MAL_HSPEC_TIMER_1:
		case MAL_HSPEC_TIMER_3:
		case MAL_HSPEC_TIMER_6:
		case MAL_HSPEC_TIMER_7:
		case MAL_HSPEC_TIMER_14:
		case MAL_HSPEC_TIMER_15:
		case MAL_HSPEC_TIMER_16:
		case MAL_HSPEC_TIMER_17:
			*resolution = 16;
			break;
		case MAL_HSPEC_TIMER_2:
			*resolution = 32;
			break;
		default:
			return MAL_ERROR_HARDWARE_INVALID;
	}
	return MAL_ERROR_OK;
}

mal_error_e mal_hspec_stm32f0_timer_pwm_init(mal_hspec_timer_pwm_init_s *init) {
	mal_error_e result;
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(init->timer);
	// Check if the timer is already initialized
	if (!(tim->CR1 & TIM_CR1_CEN)) {
		// Initialize timer
		result = mal_hspec_stm32f0_timer_init(init->timer, init->frequency, init->delta, NULL);
		if (MAL_ERROR_OK != result) {
			return result;
		}
	} else {
		// Timer is already initialized check if parameters match
		mal_timer_state_s state;
		result = mal_timer_get_state(init->timer, &state);
		if (MAL_ERROR_OK != result) {
			return result;
		}
		// Check frequency and delta
		if (init->frequency != state.frequency || init->delta != state.delta) {
			return MAL_ERROR_HARDWARE_UNAVAILABLE;
		}
	}
	// Enable GPIO clock
	RCC_AHBPeriphClockCmd(mal_hspec_stm32f0_get_rcc_gpio_port(init->pwm_io->port), ENABLE);
	// Configure alternate function
	uint8_t function;
	result = mal_hspec_stm32f0_get_timer_af(init->pwm_io, init->timer, &function);
	if (MAL_ERROR_OK != result) {
		return result;
	}
	GPIO_PinAFConfig(mal_hspec_stm32f0_get_gpio_typedef(init->pwm_io->port), init->pwm_io->pin, function);
	// Configure GPIO
	GPIO_InitTypeDef gpio_init;
	gpio_init.GPIO_Pin = MAL_HSPEC_STM32F0_GET_GPIO_PIN(init->pwm_io->pin);
	gpio_init.GPIO_Mode = GPIO_Mode_AF;
	gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
	gpio_init.GPIO_OType = GPIO_OType_PP;
	gpio_init.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(mal_hspec_stm32f0_get_gpio_typedef(init->pwm_io->port), &gpio_init);
	// Disable timer while we set the PWM output
	TIM_Cmd(tim, DISABLE);
	// Configure output channel
	TIM_OCInitTypeDef channel_init;
	channel_init.TIM_OCMode = TIM_OCMode_PWM1; // Output is active up to compare
	channel_init.TIM_OutputState = TIM_OutputState_Enable;
	channel_init.TIM_OutputNState = TIM_OutputNState_Enable;
	channel_init.TIM_Pulse = 0; // Duty cycle of 0 at init.
	channel_init.TIM_OCPolarity = TIM_OCPolarity_High;
	channel_init.TIM_OCNPolarity = TIM_OCNPolarity_High;
	channel_init.TIM_OCIdleState = TIM_OCIdleState_Reset;
	channel_init.TIM_OCNIdleState = TIM_OCNIdleState_Reset;
	// Chose the correct init function
	switch (get_timer_channel(init->pwm_io, init->timer)) {
		case TIM_Channel_1:
			TIM_OC1Init(tim, &channel_init);
			break;
		case TIM_Channel_2:
			TIM_OC2Init(tim, &channel_init);
			break;
		case TIM_Channel_3:
			TIM_OC3Init(tim, &channel_init);
			break;
		case TIM_Channel_4:
			TIM_OC4Init(tim, &channel_init);
			break;
		default:
			return MAL_ERROR_HARDWARE_INVALID;
	}
	// Enable timer
	TIM_Cmd(tim, ENABLE);
	// Check if output has to be enabled
	switch (init->timer) {
		case MAL_HSPEC_TIMER_1:
		case MAL_HSPEC_TIMER_15:
		case MAL_HSPEC_TIMER_16:
		case MAL_HSPEC_TIMER_17:
			TIM_CtrlPWMOutputs(tim, ENABLE);
			break;
		default:
			// Nothing to do for other timers
			break;
	}

	return MAL_ERROR_OK;
}

mal_error_e mal_hspec_stm32f0_timer_set_pwm_duty_cycle(mal_hspec_timer_e timer,
													   const mal_hspec_gpio_s *gpio,
													   mal_hspec_timer_pwm_value_t duty_cycle) {
	mal_error_e result;
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(timer);
	// We need to compute the duty cycle
	uint32_t compare_value = tim->ARR * duty_cycle;
	compare_value /= MAL_HSPEC_TIMER_PWM_VALUE_MAX;
	// Chose the correct set function
	switch (get_timer_channel(gpio, timer)) {
		case TIM_Channel_1:
			TIM_SetCompare1(tim, compare_value);
			break;
		case TIM_Channel_2:
			TIM_SetCompare2(tim, compare_value);
			break;
		case TIM_Channel_3:
			TIM_SetCompare3(tim, compare_value);
			break;
		case TIM_Channel_4:
			TIM_SetCompare4(tim, compare_value);
			break;
		default:
			return MAL_ERROR_HARDWARE_INVALID;
	}

	return MAL_ERROR_OK;
}

