MAL-Organization/MAL/library/src/hspec/stm/stm32f0/mal_hspec_stm32f0_timer.c
mal_error_e mal_hspec_stm32f0_timer_count_init(mal_hspec_timer_e timer,
											   mal_hspec_timer_value_t frequency) {
	mal_error_e result;
	// Initialize peripheral clock
	result = init_timer_rcc(timer);
	if (MAL_ERROR_OK != result) {
		return result;
	}
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(timer);
	// Get timer frequency
	uint64_t timer_frequency;
	result = mal_hspec_stm32f0_timer_get_input_clk(timer, &timer_frequency);
	if (MAL_ERROR_OK != result) {
		return result;
	}
	// Initialize time base timer
	TIM_TimeBaseInitTypeDef params;
	TIM_TimeBaseStructInit(&params);
	params.TIM_CounterMode = TIM_CounterMode_Up;
	// Compute prescaler
	if (0 == frequency) {
		return MAL_ERROR_CLOCK_ERROR;
	}
	uint32_t prescaler = (timer_frequency * 1000) / frequency;
	if (prescaler > (UINT16_MAX+ 1)) {
		return MAL_ERROR_CLOCK_ERROR;
	}
	// Round up prescaler to at least 1
	if (0 == prescaler) {
		prescaler += 1;
	}
	params.TIM_Prescaler = prescaler - 1;
	// Set maximum value
	uint8_t resolution;
	result = mal_hspec_stm32f0_timer_get_resolution(timer, &resolution);
	if (MAL_ERROR_OK != result) {
		return result;
	}
	uint32_t max_value = (((uint64_t)1) << ((uint64_t)resolution)) - (uint64_t)1;
	params.TIM_Period = max_value;

	TIM_TimeBaseInit(tim, &params);
	// Enable timer
	TIM_Cmd(tim, ENABLE);

	return MAL_ERROR_OK;
}

mal_error_e mal_hspec_stm32f0_timer_get_count_frequency(mal_hspec_timer_e timer,
														mal_hspec_timer_value_t *frequency) {
	mal_error_e result;
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(timer);
	if (NULL == tim) {
		return MAL_ERROR_HARDWARE_INVALID;
	}
	// Get timer frequency
	uint64_t timer_frequency;
	result = mal_hspec_stm32f0_timer_get_input_clk(timer, &timer_frequency);
	if (MAL_ERROR_OK != result) {
		return result;
	}
	// Compute frequency
	mal_hspec_timer_value_t prescaler_value = (uint32_t)tim->PSC + 1;
	*frequency = (mal_hspec_timer_value_t)timer_frequency / prescaler_value;

	return MAL_ERROR_OK;
}

mal_error_e mal_hspec_stm32f0_timer_get_count(mal_hspec_timer_e timer, uint64_t *count) {
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(timer);
	if (NULL == tim) {
		return MAL_ERROR_HARDWARE_INVALID;
	}
	// Get value
	*count = tim->CNT;

	return MAL_ERROR_OK;
}

mal_error_e mal_hspec_stm32f0_timer_input_capture_init(mal_hspec_timer_intput_capture_init_s *init) {
	mal_error_e result;
	// Get timer
	TIM_TypeDef *tim = mal_hspec_stm32f0_timer_get_timer_typedef(init->timer);
	// Check if the timer is already initialized
	if (!(tim->CR1 & TIM_CR1_CEN)) {
		// Initialize timer
		result = mal_hspec_stm32f0_timer_count_init(init->timer, init->frequency);
		if (MAL_ERROR_OK != result) {
			return result;
		}
	} else {
		// Timer is already initialized check if parameters match
		mal_timer_state_s state;
		result = mal_timer_get_state(init->timer, &state);
		if (MAL_ERROR_OK != result) {
			return result;
		}
		// Check frequency
		if (init->frequency != state.frequency) {
			return MAL_ERROR_HARDWARE_UNAVAILABLE;
		}
	}
	// Enable GPIO clock
	RCC_AHBPeriphClockCmd(mal_hspec_stm32f0_get_rcc_gpio_port(init->input_io->port), ENABLE);
	// Configure alternate function
	uint8_t function;
	result = mal_hspec_stm32f0_get_timer_af(init->input_io, init->timer, &function);
	if (MAL_ERROR_OK != result) {
		return result;
	}
	GPIO_PinAFConfig(mal_hspec_stm32f0_get_gpio_typedef(init->input_io->port), init->input_io->pin, function);
	// Configure GPIO
	GPIO_InitTypeDef gpio_init;
	gpio_init.GPIO_Pin = MAL_HSPEC_STM32F0_GET_GPIO_PIN(init->input_io->pin);
	gpio_init.GPIO_Mode = GPIO_Mode_AF;
	gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
	gpio_init.GPIO_OType = GPIO_OType_PP;
	gpio_init.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(mal_hspec_stm32f0_get_gpio_typedef(init->input_io->port), &gpio_init);
	// Disable timer while we set the PWM output
	TIM_Cmd(tim, DISABLE);
	// Get timer channel
	uint16_t timer_channel = get_timer_channel(init->input_io, init->timer);
	// Configure input channel
	TIM_ICInitTypeDef input_capture_init;
	TIM_ICStructInit(&input_capture_init);
	input_capture_init.TIM_ICSelection = TIM_ICSelection_DirectTI;
	input_capture_init.TIM_ICFilter = 0; // No filter
	// Set channel
	input_capture_init.TIM_Channel = timer_channel;
	// Set requested polarity
	switch (init->input_event) {
		case MAL_HSPEC_TIMER_INPUT_FALLING:
			input_capture_init.TIM_ICPolarity = TIM_ICPolarity_Falling;
			break;
		case MAL_HSPEC_TIMER_INPUT_RISING:
			input_capture_init.TIM_ICPolarity = TIM_ICPolarity_Rising;
			break;
		case MAL_HSPEC_TIMER_INPUT_BOTH:
		default:
			input_capture_init.TIM_ICPolarity = TIM_ICPolarity_BothEdge;
			break;
	}
	// Set input prescaler
	switch (init->input_divider) {
		case 1:
			input_capture_init.TIM_ICPrescaler = TIM_ICPSC_DIV1;
			break;
		case 2:
			input_capture_init.TIM_ICPrescaler = TIM_ICPSC_DIV2;
			break;
		case 4:
			input_capture_init.TIM_ICPrescaler = TIM_ICPSC_DIV4;
			break;
		case 8:
			input_capture_init.TIM_ICPrescaler = TIM_ICPSC_DIV8;
			break;
		default:
			return MAL_ERROR_HARDWARE_INVALID;
	}
	// Initialize input
	TIM_ICInit(tim, &input_capture_init);
	// Save callback
	timer_callbacks[init->timer].ic_cb = init->callback;
	// Enable NVIC interrupt for timer
	if (NULL != init->callback) {
		IRQn_Type irq = mal_hspec_stm32f0_get_timer_compare_irq(init->timer);
		NVIC_EnableIRQ(irq);
		NVIC_SetPriority(irq, 2); // MAL Issue #19 Find a way to manage priorities for interrupts
		// Enable timer interrupt
		uint16_t tim_interrupt;
		switch (timer_channel) {
			case TIM_Channel_1:
				tim_interrupt = TIM_IT_CC1;
				break;
			case TIM_Channel_2:
				tim_interrupt = TIM_IT_CC2;
				break;
			case TIM_Channel_3:
				tim_interrupt = TIM_IT_CC3;
				break;
			case TIM_Channel_4:
			default:
				tim_interrupt = TIM_IT_CC4;
				break;
		}
		TIM_ITConfig(tim, tim_interrupt, ENABLE);
	}
	// Enable timer
	TIM_Cmd(tim, ENABLE);

	return MAL_ERROR_OK;
}

static void timer_input_capture_interrupt(mal_hspec_timer_e timer, TIM_TypeDef *stm_timer, uint16_t flags) {
	// Check every channel and execute callbacks
	if (flags & TIM_FLAG_CC1) {
		if (timer_callbacks[timer].ic_cb != NULL) {
			timer_callbacks[timer].ic_cb(timer, stm_timer->CCR1);
		}
	}
	if (flags & TIM_FLAG_CC2) {
		if (timer_callbacks[timer].ic_cb != NULL) {
			timer_callbacks[timer].ic_cb(timer, stm_timer->CCR2);
		}
	}
	if (flags & TIM_FLAG_CC3) {
		if (timer_callbacks[timer].ic_cb != NULL) {
			timer_callbacks[timer].ic_cb(timer, stm_timer->CCR3);
		}
	}
	if (flags & TIM_FLAG_CC4) {
		if (timer_callbacks[timer].ic_cb != NULL) {
			timer_callbacks[timer].ic_cb(timer, stm_timer->CCR4);
		}
	}
}
